class CardList {
  static List<String> sanGuo1() {
    return [
      "卧龙", "凤雏", "曹操", "孙权", "刘备", "关羽", "张飞", "马超", "黄忠", "赵云",
      "张辽", "徐晃", "张郃", "于禁", "乐进", "许褚", "典韦", "关兴", "张苞", "曹纯",
      "周瑜", "鲁肃", "吕蒙", "陆逊", "陆抗", "徐盛", "丁奉", "马忠", "潘璋", "黄盖",
      "郭嘉", "程昱", "荀彧", "荀攸", "荀谌", "张昭", "顾雍", "阚泽", "程秉", "虞翻",
      "张南", "冯习", "魏延", "姜维", "邓艾", "钟会",
    ];
  }

  static List<String> han1() {
    return [
      "刘邦", "刘盈", "刘恒", "刘启", "刘彻", "刘询", "刘秀", "刘庄", "刘炟", "刘贺",
      "萧何", "韩信", "张良", "英布", "吕后", "周勃", "陈平", "曹参", "卫青", "霍光",
      "王莽", "邓禹", "寇恂", "班超", "班固", "班昭", "张骞", "马援", "苏武", "李广",
      "刘安", "刘长", "刘歆", "刘玄", "王匡", "王凤", "董卓", "刘辩", "刘协", "刘宏",
      "伏完", "董承", "杨彪", "王允", "孔融",
    ];
  }
}
