/*
 * 文件用途：注释
 */

/*
 * extern "C"{
 *     int getrnd(int,int)
 * }
 *
 * 左闭右开原则
 */

/*
 * void MyFrame::ancient_shop_guwan(WXBTNEVT& _)
 *
 * 普通古玩：黄金5两
 * 概率：
 * 假货 55%
 * 玉佩 35%
 * 瓷器 10%
 * 碑刻 0%
 *
 * 高级古玩：黄金10两
 * 概率：
 * 假货 35%
 * 玉佩 30% (x2)
 * 瓷器 25%
 * 碑刻 10%
 * 
 * 珍藏古玩：黄金30两
 * 概率：
 * 假货 15%
 * 玉佩 35% (x2)
 * 瓷器 25% (x2)
 * 碑刻 25%
 * 
 * 茶壶古玩：黄金20两
 * 概率：
 * 假货 50%
 * 茶壶 50%
 * 
 * 茶盏古玩：黄金30两
 * 概率：
 * 假货 50%
 * 茶盏 50% (x4)
 * 
 * 茶具古玩：黄金35两
 * 概率：
 * 假货 40%
 * 茶壶 35%
 * 茶盏 25% (x4)
 * 
 * 综合古玩：黄金50两
 * 概率：
 * 假货 10%
 * 玉佩 20% (x2)
 * 瓷器 15% (x2)
 * 碑刻 10%
 * 茶壶 25%
 * 茶盏 20% (x4)
 * 
 * 诚信古玩：黄金70两
 * 概率：
 * 玉佩 25% (x2)
 * 瓷器 20% (x2)
 * 碑刻 10%
 * 茶壶 25%
 * 茶盏 20% (x4)
 */

/*
 * #define MYLAST(function) \
 * ......
 *
 * 用途：
 * 整合MYBACK与MYUSE，
 * 使用MYLAST(function)相当于
 * 依次使用MYBACK(function,1)
 * 与MYUSE()
 */

/*
 * void MyFrame::baoshi_choujiang1(WXBTNEVT&)
 *
 * 价格：5颗宝石
 * 概率：
 * 汉朝卡牌1*2：5%
 * 铜钱50枚：20%
 * 积分*50：25%
 * 仙币*30：50%
 */
